Revit 2024 API
BuiltInFailures.DocumentFailures Class
 Failures about DocumentFailures.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class DocumentFailures
Visual Basic
Public NotInheritable Class DocumentFailures
Visual C++
public ref class DocumentFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DocumentFailures
See Also
BuiltInFailures.DocumentFailures Members
Autodesk.Revit.DB Namespace